; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob31) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate8)
	(at pallet1 distributor0)
	(clear crate12)
	(at pallet2 distributor1)
	(clear crate10)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 351)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 214)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(= (weight crate0) 6)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(= (weight crate1) 43)
	(at crate2 depot0)
	(on crate2 pallet0)
	(= (weight crate2) 29)
	(at crate3 distributor1)
	(on crate3 crate0)
	(= (weight crate3) 1)
	(at crate4 distributor1)
	(on crate4 crate3)
	(= (weight crate4) 93)
	(at crate5 distributor0)
	(on crate5 crate1)
	(= (weight crate5) 28)
	(at crate6 distributor0)
	(on crate6 crate5)
	(= (weight crate6) 19)
	(at crate7 distributor0)
	(on crate7 crate6)
	(= (weight crate7) 98)
	(at crate8 depot0)
	(on crate8 crate2)
	(= (weight crate8) 4)
	(at crate9 distributor0)
	(on crate9 crate7)
	(= (weight crate9) 12)
	(at crate10 distributor1)
	(on crate10 crate4)
	(= (weight crate10) 31)
	(at crate11 distributor0)
	(on crate11 crate9)
	(= (weight crate11) 65)
	(at crate12 distributor0)
	(on crate12 crate11)
	(= (weight crate12) 47)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate1 crate2)
		(on crate2 crate6)
		(on crate3 crate10)
		(on crate4 crate7)
		(on crate6 crate12)
		(on crate7 pallet0)
		(on crate8 crate4)
		(on crate9 pallet2)
		(on crate10 crate1)
		(on crate11 pallet1)
		(on crate12 crate11)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist2 crate10 crate4 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist2) (on crate10 crate4)
   added: (lifting hoist2 crate10) (clear crate4)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 11
2. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 1 to 11
   goals met: 1 of 11
3. (load hoist2 crate10 truck0 distributor1)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 31
   goals met: 1 of 11
4. (lift hoist2 crate4 crate3 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 crate3)
   added: (lifting hoist2 crate4) (clear crate3)
   changed: (fuel-cost) from 11 to 12
   goals met: 1 of 11
5. (load hoist2 crate4 truck0 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   changed: (current_load truck0) from 31 to 124
   goals met: 1 of 11
6. (lift hoist0 crate8 crate2 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 crate2)
   added: (lifting hoist0 crate8) (clear crate2)
   changed: (fuel-cost) from 12 to 13
   goals met: 1 of 11
7. (lift hoist2 crate3 crate0 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 crate0)
   added: (lifting hoist2 crate3) (clear crate0)
   changed: (fuel-cost) from 13 to 14
   goals met: 1 of 11
8. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 14 to 24
   goals met: 1 of 11
9. (load hoist0 crate8 truck0 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck0) (available hoist0)
   changed: (current_load truck0) from 124 to 128
   goals met: 1 of 11
10. (lift hoist0 crate2 pallet0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 pallet0)
   added: (lifting hoist0 crate2) (clear pallet0)
   changed: (fuel-cost) from 24 to 25
   goals met: 1 of 11
11. (drop hoist2 crate3 crate0 distributor1)
   deleted: (lifting hoist2 crate3) (clear crate0)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 crate0)
   goals met: 1 of 11
12. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   changed: (current_load truck0) from 128 to 157
   goals met: 1 of 11
13. (unload hoist0 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist0)
   added: (lifting hoist0 crate8)
   changed: (current_load truck0) from 157 to 153
   goals met: 1 of 11
14. (lift hoist2 crate3 crate0 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 crate0)
   added: (lifting hoist2 crate3) (clear crate0)
   changed: (fuel-cost) from 25 to 26
   goals met: 1 of 11
15. (lift hoist1 crate12 crate11 distributor0)
   deleted: (at crate12 distributor0) (clear crate12) (available hoist1) (on crate12 crate11)
   added: (lifting hoist1 crate12) (clear crate11)
   changed: (fuel-cost) from 26 to 27
   goals met: 0 of 11
16. (load hoist1 crate12 truck1 distributor0)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 47
   goals met: 0 of 11
17. (lift hoist1 crate11 crate9 distributor0)
   deleted: (at crate11 distributor0) (clear crate11) (available hoist1) (on crate11 crate9)
   added: (lifting hoist1 crate11) (clear crate9)
   changed: (fuel-cost) from 27 to 28
   goals met: 0 of 11
18. (load hoist1 crate11 truck1 distributor0)
   deleted: (lifting hoist1 crate11)
   added: (in crate11 truck1) (available hoist1)
   changed: (current_load truck1) from 47 to 112
   goals met: 0 of 11
19. (unload hoist1 crate12 truck1 distributor0)
   deleted: (in crate12 truck1) (available hoist1)
   added: (lifting hoist1 crate12)
   changed: (current_load truck1) from 112 to 65
   goals met: 0 of 11
20. (load hoist0 crate8 truck0 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck0) (available hoist0)
   changed: (current_load truck0) from 153 to 157
   goals met: 0 of 11
21. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck0) from 157 to 64
   goals met: 0 of 11
22. (load hoist1 crate12 truck1 distributor0)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck1) (available hoist1)
   changed: (current_load truck1) from 65 to 112
   goals met: 0 of 11
23. (lift hoist1 crate9 crate7 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist1) (on crate9 crate7)
   added: (lifting hoist1 crate9) (clear crate7)
   changed: (fuel-cost) from 28 to 29
   goals met: 0 of 11
24. (load hoist1 crate9 truck1 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck1) (available hoist1)
   changed: (current_load truck1) from 112 to 124
   goals met: 0 of 11
25. (unload hoist1 crate12 truck1 distributor0)
   deleted: (in crate12 truck1) (available hoist1)
   added: (lifting hoist1 crate12)
   changed: (current_load truck1) from 124 to 77
   goals met: 0 of 11
26. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 29 to 39
   goals met: 0 of 11
27. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   changed: (current_load truck1) from 77 to 170
   goals met: 0 of 11
28. (unload hoist0 crate11 truck1 depot0)
   deleted: (in crate11 truck1) (available hoist0)
   added: (lifting hoist0 crate11)
   changed: (current_load truck1) from 170 to 105
   goals met: 0 of 11
29. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 39 to 49
   goals met: 0 of 11
30. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 49 to 59
   goals met: 0 of 11
31. (load hoist1 crate12 truck1 distributor0)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck1) (available hoist1)
   changed: (current_load truck1) from 105 to 152
   goals met: 0 of 11
32. (unload hoist1 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck0) from 64 to 33
   goals met: 0 of 11
33. (load hoist1 crate10 truck1 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck1) (available hoist1)
   changed: (current_load truck1) from 152 to 183
   goals met: 0 of 11
34. (lift hoist1 crate7 crate6 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate6)
   added: (lifting hoist1 crate7) (clear crate6)
   changed: (fuel-cost) from 59 to 60
   goals met: 0 of 11
35. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   changed: (current_load truck0) from 33 to 131
   goals met: 0 of 11
36. (lift hoist1 crate6 crate5 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate5)
   added: (lifting hoist1 crate6) (clear crate5)
   changed: (fuel-cost) from 60 to 61
   goals met: 0 of 11
37. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   changed: (current_load truck1) from 183 to 202
   goals met: 0 of 11
38. (lift hoist1 crate5 crate1 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate1)
   added: (lifting hoist1 crate5) (clear crate1)
   changed: (fuel-cost) from 61 to 62
   goals met: 0 of 11
39. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 62 to 72
   goals met: 0 of 11
40. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 72 to 82
   goals met: 0 of 11
41. (load hoist2 crate3 truck1 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   changed: (current_load truck1) from 202 to 203
   goals met: 0 of 11
42. (drop hoist1 crate5 crate1 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate1)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate1)
   goals met: 0 of 11
43. (drop hoist0 crate11 pallet0 depot0)
   deleted: (lifting hoist0 crate11) (clear pallet0)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 pallet0)
   goals met: 0 of 11
44. (unload hoist2 crate12 truck1 distributor1)
   deleted: (in crate12 truck1) (available hoist2)
   added: (lifting hoist2 crate12)
   changed: (current_load truck1) from 203 to 156
   goals met: 0 of 11
45. (load hoist2 crate12 truck0 distributor1)
   deleted: (lifting hoist2 crate12)
   added: (in crate12 truck0) (available hoist2)
   changed: (current_load truck0) from 131 to 178
   goals met: 0 of 11
46. (unload hoist2 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck1) from 156 to 155
   goals met: 0 of 11
47. (load hoist2 crate3 truck0 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 178 to 179
   goals met: 0 of 11
48. (unload hoist2 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck1) from 155 to 62
   goals met: 0 of 11
49. (load hoist2 crate4 truck0 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   changed: (current_load truck0) from 179 to 272
   goals met: 0 of 11
50. (unload hoist2 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck0) from 272 to 268
   goals met: 0 of 11
51. (load hoist2 crate8 truck1 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   changed: (current_load truck1) from 62 to 66
   goals met: 0 of 11
52. (unload hoist2 crate12 truck0 distributor1)
   deleted: (in crate12 truck0) (available hoist2)
   added: (lifting hoist2 crate12)
   changed: (current_load truck0) from 268 to 221
   goals met: 0 of 11
53. (load hoist2 crate12 truck1 distributor1)
   deleted: (lifting hoist2 crate12)
   added: (in crate12 truck1) (available hoist2)
   changed: (current_load truck1) from 66 to 113
   goals met: 0 of 11
54. (unload hoist2 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck1) from 113 to 94
   goals met: 0 of 11
55. (load hoist2 crate6 truck0 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   changed: (current_load truck0) from 221 to 240
   goals met: 0 of 11
56. (unload hoist2 crate12 truck1 distributor1)
   deleted: (in crate12 truck1) (available hoist2)
   added: (lifting hoist2 crate12)
   changed: (current_load truck1) from 94 to 47
   goals met: 0 of 11
57. (load hoist2 crate12 truck0 distributor1)
   deleted: (lifting hoist2 crate12)
   added: (in crate12 truck0) (available hoist2)
   changed: (current_load truck0) from 240 to 287
   goals met: 0 of 11
58. (unload hoist2 crate8 truck1 distributor1)
   deleted: (in crate8 truck1) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck1) from 47 to 43
   goals met: 0 of 11
59. (load hoist2 crate8 truck0 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck0) (available hoist2)
   changed: (current_load truck0) from 287 to 291
   goals met: 0 of 11
60. (unload hoist2 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist2)
   added: (lifting hoist2 crate2)
   changed: (current_load truck0) from 291 to 262
   goals met: 0 of 11
61. (load hoist2 crate2 truck1 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck1) (available hoist2)
   changed: (current_load truck1) from 43 to 72
   goals met: 0 of 11
62. (unload hoist2 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck0) from 262 to 169
   goals met: 0 of 11
63. (load hoist2 crate4 truck1 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck1) (available hoist2)
   changed: (current_load truck1) from 72 to 165
   goals met: 0 of 11
64. (lift hoist0 crate11 pallet0 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 pallet0)
   added: (lifting hoist0 crate11) (clear pallet0)
   changed: (fuel-cost) from 82 to 83
   goals met: 0 of 11
65. (unload hoist2 crate12 truck0 distributor1)
   deleted: (in crate12 truck0) (available hoist2)
   added: (lifting hoist2 crate12)
   changed: (current_load truck0) from 169 to 122
   goals met: 0 of 11
66. (load hoist2 crate12 truck1 distributor1)
   deleted: (lifting hoist2 crate12)
   added: (in crate12 truck1) (available hoist2)
   changed: (current_load truck1) from 165 to 212
   goals met: 0 of 11
67. (unload hoist2 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck0) from 122 to 121
   goals met: 0 of 11
68. (load hoist2 crate3 truck1 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   changed: (current_load truck1) from 212 to 213
   goals met: 0 of 11
69. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 83 to 93
   goals met: 0 of 11
70. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 93 to 103
   goals met: 0 of 11
71. (load hoist0 crate11 truck0 depot0)
   deleted: (lifting hoist0 crate11)
   added: (in crate11 truck0) (available hoist0)
   changed: (current_load truck0) from 121 to 186
   goals met: 0 of 11
72. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   changed: (fuel-cost) from 103 to 104
   goals met: 0 of 11
73. (lift hoist1 crate5 crate1 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate1)
   added: (lifting hoist1 crate5) (clear crate1)
   changed: (fuel-cost) from 104 to 105
   goals met: 0 of 11
74. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck1) from 213 to 212
   goals met: 0 of 11
75. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   changed: (current_load truck0) from 186 to 187
   goals met: 0 of 11
76. (unload hoist0 crate9 truck1 depot0)
   deleted: (in crate9 truck1) (available hoist0)
   added: (lifting hoist0 crate9)
   changed: (current_load truck1) from 212 to 200
   goals met: 0 of 11
77. (load hoist0 crate9 truck0 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck0) (available hoist0)
   changed: (current_load truck0) from 187 to 199
   goals met: 0 of 11
78. (unload hoist0 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist0)
   added: (lifting hoist0 crate8)
   changed: (current_load truck0) from 199 to 195
   goals met: 0 of 11
79. (load hoist0 crate8 truck1 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck1) (available hoist0)
   changed: (current_load truck1) from 200 to 204
   goals met: 0 of 11
80. (unload hoist0 crate7 truck0 depot0)
   deleted: (in crate7 truck0) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck0) from 195 to 97
   goals met: 0 of 11
81. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 105 to 115
   goals met: 0 of 11
82. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 115 to 125
   goals met: 0 of 11
83. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 125 to 135
   goals met: 0 of 11
84. (drop hoist0 crate7 pallet0 depot0)
   deleted: (lifting hoist0 crate7) (clear pallet0)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 pallet0)
   goals met: 1 of 11
85. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 97 to 125
   goals met: 1 of 11
86. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 135 to 136
   goals met: 1 of 11
87. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 125 to 168
   goals met: 1 of 11
88. (lift hoist0 crate7 pallet0 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 pallet0)
   added: (lifting hoist0 crate7) (clear pallet0)
   changed: (fuel-cost) from 136 to 137
   goals met: 0 of 11
89. (unload hoist1 crate10 truck1 distributor0)
   deleted: (in crate10 truck1) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck1) from 204 to 173
   goals met: 0 of 11
90. (load hoist1 crate10 truck0 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck0) (available hoist1)
   changed: (current_load truck0) from 168 to 199
   goals met: 0 of 11
91. (unload hoist1 crate12 truck1 distributor0)
   deleted: (in crate12 truck1) (available hoist1)
   added: (lifting hoist1 crate12)
   changed: (current_load truck1) from 173 to 126
   goals met: 0 of 11
92. (load hoist1 crate12 truck0 distributor0)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck0) (available hoist1)
   changed: (current_load truck0) from 199 to 246
   goals met: 0 of 11
93. (unload hoist1 crate2 truck1 distributor0)
   deleted: (in crate2 truck1) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck1) from 126 to 97
   goals met: 0 of 11
94. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 137 to 147
   goals met: 0 of 11
95. (load hoist0 crate7 truck1 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck1) (available hoist0)
   changed: (current_load truck1) from 97 to 195
   goals met: 0 of 11
96. (load hoist1 crate2 truck0 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   changed: (current_load truck0) from 246 to 275
   goals met: 0 of 11
97. (unload hoist1 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck0) from 275 to 244
   goals met: 0 of 11
98. (unload hoist0 crate4 truck1 depot0)
   deleted: (in crate4 truck1) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck1) from 195 to 102
   goals met: 0 of 11
99. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 147 to 157
   goals met: 0 of 11
100. (load hoist2 crate0 truck0 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   changed: (current_load truck0) from 244 to 250
   goals met: 0 of 11
101. (unload hoist2 crate9 truck0 distributor1)
   deleted: (in crate9 truck0) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck0) from 250 to 238
   goals met: 0 of 11
102. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 157 to 167
   goals met: 0 of 11
103. (drop hoist2 crate9 pallet2 distributor1)
   deleted: (lifting hoist2 crate9) (clear pallet2)
   added: (available hoist2) (at crate9 distributor1) (clear crate9) (on crate9 pallet2)
   goals met: 1 of 11
104. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   changed: (current_load truck1) from 102 to 195
   goals met: 1 of 11
105. (load hoist1 crate10 truck0 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck0) (available hoist1)
   changed: (current_load truck0) from 238 to 269
   goals met: 1 of 11
106. (unload hoist1 crate11 truck0 distributor0)
   deleted: (in crate11 truck0) (available hoist1)
   added: (lifting hoist1 crate11)
   changed: (current_load truck0) from 269 to 204
   goals met: 1 of 11
107. (drop hoist1 crate11 pallet1 distributor0)
   deleted: (lifting hoist1 crate11) (clear pallet1)
   added: (available hoist1) (at crate11 distributor0) (clear crate11) (on crate11 pallet1)
   goals met: 2 of 11
108. (unload hoist1 crate12 truck0 distributor0)
   deleted: (in crate12 truck0) (available hoist1)
   added: (lifting hoist1 crate12)
   changed: (current_load truck0) from 204 to 157
   goals met: 2 of 11
109. (drop hoist1 crate12 crate11 distributor0)
   deleted: (lifting hoist1 crate12) (clear crate11)
   added: (available hoist1) (at crate12 distributor0) (clear crate12) (on crate12 crate11)
   goals met: 3 of 11
110. (unload hoist0 crate7 truck1 depot0)
   deleted: (in crate7 truck1) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck1) from 195 to 97
   goals met: 3 of 11
111. (unload hoist1 crate6 truck0 distributor0)
   deleted: (in crate6 truck0) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck0) from 157 to 138
   goals met: 3 of 11
112. (drop hoist1 crate6 crate12 distributor0)
   deleted: (lifting hoist1 crate6) (clear crate12)
   added: (available hoist1) (at crate6 distributor0) (clear crate6) (on crate6 crate12)
   goals met: 4 of 11
113. (drop hoist0 crate7 pallet0 depot0)
   deleted: (lifting hoist0 crate7) (clear pallet0)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 pallet0)
   goals met: 5 of 11
114. (unload hoist1 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck0) from 138 to 109
   goals met: 5 of 11
115. (unload hoist0 crate4 truck1 depot0)
   deleted: (in crate4 truck1) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck1) from 97 to 4
   goals met: 5 of 11
116. (drop hoist0 crate4 crate7 depot0)
   deleted: (lifting hoist0 crate4) (clear crate7)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate7)
   goals met: 6 of 11
117. (unload hoist0 crate8 truck1 depot0)
   deleted: (in crate8 truck1) (available hoist0)
   added: (lifting hoist0 crate8)
   changed: (current_load truck1) from 4 to 0
   goals met: 6 of 11
118. (drop hoist1 crate2 crate6 distributor0)
   deleted: (lifting hoist1 crate2) (clear crate6)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 crate6)
   goals met: 7 of 11
119. (unload hoist1 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist1)
   added: (lifting hoist1 crate1)
   changed: (current_load truck0) from 109 to 66
   goals met: 7 of 11
120. (drop hoist1 crate1 crate2 distributor0)
   deleted: (lifting hoist1 crate1) (clear crate2)
   added: (available hoist1) (at crate1 distributor0) (clear crate1) (on crate1 crate2)
   goals met: 8 of 11
121. (unload hoist1 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck0) from 66 to 35
   goals met: 8 of 11
122. (drop hoist1 crate10 crate1 distributor0)
   deleted: (lifting hoist1 crate10) (clear crate1)
   added: (available hoist1) (at crate10 distributor0) (clear crate10) (on crate10 crate1)
   goals met: 9 of 11
123. (unload hoist1 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck0) from 35 to 34
   goals met: 9 of 11
124. (drop hoist1 crate3 crate10 distributor0)
   deleted: (lifting hoist1 crate3) (clear crate10)
   added: (available hoist1) (at crate3 distributor0) (clear crate3) (on crate3 crate10)
   goals met: 10 of 11
125. (drop hoist0 crate8 crate4 depot0)
   deleted: (lifting hoist0 crate8) (clear crate4)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 crate4)
   goals met: 11 of 11
